<!DOCTYPE HTML>
<html lang="zh-CN">


<head>
    <meta charset="utf-8">
    <meta name="keywords" content="msvc中类对象的大小, Lovezdf">
    <meta name="description" content="本科 | 数据科学与大数据技术">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
    <meta name="renderer" content="webkit|ie-stand|ie-comp">
    <meta name="mobile-web-app-capable" content="yes">
    <meta name="format-detection" content="telephone=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black-translucent">
    <meta name="google-site-verification" content="pBWoGvVEP36FzzS4xIpoMejc5UKi3RKcxd9rWWcjiDg" />
    <!-- Global site tag (gtag.js) - Google Analytics -->


    <title>msvc中类对象的大小 | Lovezdf</title>

    <link rel="icon" type="image/jpeg" href="https://z3.ax1x.com/2021/09/20/48WKZ4.jpg">

    <link rel="stylesheet" type="text/css" href="/libs/awesome/css/all.css">
    <link rel="stylesheet" type="text/css" href="/libs/materialize/materialize.min.css">
    <link rel="stylesheet" type="text/css" href="/libs/aos/aos.css">
    <link rel="stylesheet" type="text/css" href="/libs/animate/animate.min.css">
    <link rel="stylesheet" type="text/css" href="/libs/lightGallery/css/lightgallery.min.css">
    <link rel="stylesheet" type="text/css" href="/css/matery.css">
    <link rel="stylesheet" type="text/css" href="/css/my.css">


                </div>
            </div>

            <div class="post-info">
                
                <div class="post-date info-break-policy">
                    <i class="far fa-calendar-minus fa-fw"></i>发布日期:&nbsp;&nbsp;
                    2021-09-20
                </div>
                

                
                <div class="post-date info-break-policy">
                    <i class="far fa-calendar-check fa-fw"></i>更新日期:&nbsp;&nbsp;
                    2021-09-21
                </div>
                

                
                <div class="info-break-policy">
                    <i class="far fa-file-word fa-fw"></i>文章字数:&nbsp;&nbsp;
                    1.8k
                </div>
                

                
                <div class="info-break-policy">
                    <i class="far fa-clock fa-fw"></i>阅读时长:&nbsp;&nbsp;
                    8 分
                </div>
                

                
            </div>
        </div>
        <hr class="clearfix">

        
        <!-- 是否加载使用自带的 prismjs. -->
        <link rel="stylesheet" href="/libs/prism/prism.css">
        

        

        <div class="card-content article-card-content">
            <div id="articleContent">
                <h1 id="msvc中类对象的大小"><a href="#msvc中类对象的大小" class="headerlink" title="msvc中类对象的大小"></a>msvc中类对象的大小</h1><p>本文主要来介绍一下在msvc编译器中，类对象的内存分配问题。</p>
<p><strong>test1</strong> 空类</p>
<pre class="line-numbers language-none"><code class="language-none">class A {
public:
};<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span></span></code></pre>
<p><a target="_blank" rel="noopener" href="https://imgtu.com/i/4JsO2T"><img src="https://z3.ax1x.com/2021/09/21/4JsO2T.png"></a><br>如果一个类是空类，那么编译器会为它分配一个字符量，这样空类的大小就为1。</p>
<p><strong>test2</strong>  不含虚函数的类</p>
<pre class="line-numbers language-cpp" data-language="cpp"><code class="language-cpp"><span class="token keyword">class</span> <span class="token class-name">A</span> <span class="token punctuation">{</span>
    <span class="token keyword">char</span> a<span class="token punctuation">;</span>
    <span class="token keyword">double</span> x<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>   
<span class="token punctuation">}</span><span class="token punctuation">;</span><span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p>在计算类对象的大小时需要考虑<strong>字节对齐</strong>。</p>
<ul>
<li><strong>数据成员的字节对齐</strong>：每个非静态数据成员的偏移量应该是其本身类型大小的整数倍。</li>
<li><strong>整体对象的字节对齐</strong>：最终该类对象的大小应该是其非静态数据成员的最大类型大小的整数倍。</li>
</ul>
<p>因此，在考虑字节对齐的情况下，本例中，类A的大小即为（1(char成员1字节)+7(字节对齐)+8(double成员 8字节)=16字节）。<br><a target="_blank" rel="noopener" href="https://imgtu.com/i/4JyQit"><img src="https://z3.ax1x.com/2021/09/21/4JyQit.png"></a><br>对象内存分布如下：</p>
<pre class="line-numbers language-none"><code class="language-none">class A	size(16):
1&gt;	+---
1&gt; 0	| a
1&gt;  	| &lt;alignment member&gt; (size=7)
1&gt; 8	| x
1&gt;	+---<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<hr>
<p><strong>test3</strong> 含有虚函数的类</p>
<pre class="line-numbers language-cpp" data-language="cpp"><code class="language-cpp"><span class="token keyword">class</span> <span class="token class-name">A</span> <span class="token punctuation">{</span>
<span class="token keyword">public</span><span class="token operator">:</span>
    <span class="token keyword">char</span> a<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
   <span class="token keyword">virtual</span> <span class="token keyword">void</span> <span class="token function">print</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span> cout <span class="token operator">&lt;&lt;</span> <span class="token string">"A"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span> <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span><span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p>由于在本例中，该类A含有虚函数，因此类对象的首部会存在一个指向虚函数表的指针。因此该类对象的大小为 4(虚表指针4字节)+1(char成员1字节)+3(字节对齐)=8字节。</p>
<pre class="line-numbers language-none"><code class="language-none">class A	size(8):
1&gt;	+---
1&gt; 0	| {vfptr}
1&gt; 4	| a
1&gt;  	| &lt;alignment member&gt; (size=3)
1&gt;	+---
1&gt;A::$vftable@:
1&gt;	| &amp;A_meta
1&gt;	|  0
1&gt; 0	| &amp;A::print
1&gt;A::print this adjustor: 0<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<p><strong>test4</strong></p>
<pre class="line-numbers language-cpp" data-language="cpp"><code class="language-cpp"><span class="token keyword">class</span> <span class="token class-name">A</span> <span class="token punctuation">{</span>
<span class="token keyword">public</span><span class="token operator">:</span>
    <span class="token keyword">char</span> a<span class="token punctuation">;</span>
    <span class="token keyword">double</span> x<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
   <span class="token keyword">virtual</span> <span class="token keyword">void</span> <span class="token function">print</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span> cout <span class="token operator">&lt;&lt;</span> <span class="token string">"A"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span> <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span><span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p>当对象内存在double类型，或者更大类型的数据成员时，虚表指针的大小就会变为8字节，<strong>可能是字节对齐的原因</strong>，目前没有找到合理的解释。<br>在本例中，该类对象A的大小是 8(虚表指针)+1(char1字节)+7(字节对齐)+8(double8字节)=24字节<br><a target="_blank" rel="noopener" href="https://imgtu.com/i/4JyGQS"><img src="https://z3.ax1x.com/2021/09/21/4JyGQS.png"></a></p>
<pre class="line-numbers language-none"><code class="language-none">class A	size(24):
1&gt;	+---
1&gt; 0	| {vfptr}
1&gt; 8	| c
1&gt;  	| &lt;alignment member&gt; (size=7)
1&gt;16	| x
1&gt;	+---
1&gt;A::$vftable@:
1&gt;	| &amp;A_meta
1&gt;	|  0
1&gt; 0	| &amp;A::print
1&gt;A::print this adjustor: 0<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p><strong>test5</strong>  多重继承</p>
<pre class="line-numbers language-cpp" data-language="cpp"><code class="language-cpp"><span class="token keyword">class</span> <span class="token class-name">C</span> <span class="token punctuation">{</span>
<span class="token keyword">public</span><span class="token operator">:</span>
    <span class="token keyword">double</span> z<span class="token punctuation">;</span>
    <span class="token keyword">double</span> zz<span class="token punctuation">;</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">A</span> <span class="token punctuation">{</span>
<span class="token keyword">public</span><span class="token operator">:</span>
   <span class="token keyword">char</span> c<span class="token punctuation">;</span>
   <span class="token keyword">double</span> x<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
   <span class="token keyword">virtual</span> <span class="token keyword">void</span> <span class="token function">print</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span> cout <span class="token operator">&lt;&lt;</span> <span class="token string">"A"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span> <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">B</span> <span class="token operator">:</span><span class="token base-clause"><span class="token keyword">public</span> <span class="token class-name">C</span><span class="token punctuation">,</span><span class="token keyword">public</span> <span class="token class-name">A</span></span> <span class="token punctuation">{</span>
    <span class="token keyword">int</span> c<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
    <span class="token keyword">void</span> <span class="token function">print</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span> cout <span class="token operator">&lt;&lt;</span> <span class="token string">"B"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span> <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span><span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<p>当某个类对象同时继承多个类时(即多重继承)，则<strong>父类中有虚函数的类对象位于前面，没有虚函数的类对象位于后面</strong>。<br>在本例中，如果类A中没有虚函数，那么类C应该位于类B的前部，但是由于A中包含虚函数，因此类A在前，类C在后。<br>类B大小： 24(类A大小24字节)+16(类C大小16字节)+4(int成员变量4字节)+4(字节对齐4字节)=48字节<br><a target="_blank" rel="noopener" href="https://imgtu.com/i/4JyUds"><img src="https://z3.ax1x.com/2021/09/21/4JyUds.png"></a></p>
<pre class="line-numbers language-none"><code class="language-none">1&gt;class B	size(48):
1&gt;	+---
1&gt; 0	| +--- (base class A)
1&gt; 0	| | {vfptr}
1&gt; 8	| | c
1&gt;  	| | &lt;alignment member&gt; (size=7)
1&gt;16	| | x
1&gt;	| +---
1&gt;24	| +--- (base class C)
1&gt;24	| | z
1&gt;32	| | zz
1&gt;	| +---
1&gt;40	| c
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;B::$vftable@:
1&gt;	| &amp;B_meta
1&gt;	|  0
1&gt; 0	| &amp;B::print
1&gt;B::print this adjustor: 0<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p><strong>test6</strong> 单一虚继承<br>对于虚继承，虚基类位于子类的末尾位置，不考虑字节对齐。在子类部分的首部(不包括继承其他类的部分)有一个指向该虚基类的虚指针。该虚指针的对齐方式与前面的虚表指针一样。</p>
<pre class="line-numbers language-cpp" data-language="cpp"><code class="language-cpp"><span class="token keyword">class</span> <span class="token class-name">C</span> <span class="token punctuation">{</span>
<span class="token keyword">public</span><span class="token operator">:</span>
    <span class="token keyword">char</span> s<span class="token punctuation">;</span>

<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">A</span> <span class="token punctuation">{</span>
   <span class="token keyword">char</span> az<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">B</span> <span class="token operator">:</span> <span class="token base-clause"><span class="token keyword">virtual</span> <span class="token keyword">public</span> <span class="token class-name">A</span><span class="token punctuation">,</span> <span class="token keyword">public</span> <span class="token class-name">C</span></span> <span class="token punctuation">{</span>
    <span class="token keyword">char</span> ca<span class="token punctuation">;</span>
    <span class="token keyword">int</span> a<span class="token punctuation">;</span>
    <span class="token keyword">double</span> s<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>

<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">void</span> <span class="token function">main</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
    cout <span class="token operator">&lt;&lt;</span> <span class="token keyword">sizeof</span><span class="token punctuation">(</span>B<span class="token punctuation">)</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span>
<span class="token punctuation">}</span><span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<pre class="line-numbers language-none"><code class="language-none">1&gt;class B	size(25):
1&gt;	+---
1&gt; 0	| +--- (base class C)
1&gt; 0	| | s
1&gt;	| +---
1&gt; 4	| {vbptr}
1&gt; 9	| ca
1&gt;  	| &lt;alignment member&gt; (size=2)
1&gt;12	| a
1&gt;16	| s
1&gt;	+---
1&gt;	+--- (virtual base A)
1&gt;24	| az
1&gt;	+---
1&gt;B::$vbtable@:
1&gt; 0	| -4
1&gt; 1	| 20 (Bd(B+4)A)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1&gt;               A      24       4       4 0<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p>对于此对象模型的解释，可以从以下这篇文章得到一个大概的解释。<br><a target="_blank" rel="noopener" href="https://blog.csdn.net/chengonghao/article/details/51679743">https://blog.csdn.net/chengonghao/article/details/51679743</a></p>
<p>首先，类C在首部，大小为1个字节，而后就是虚指针，由于虚指针需要保证字节对齐，因此首先要在虚指针前面添加三个字节，保证指针字节对齐，又由于类B需要虚指针整体字节对齐，因此需要在虚指针后面添加一个字节，保证虚指针整体大小为8个字节。<br>因此，类B的大小为(1(类C 1字节)+3(字节对齐3字节)+4(虚指针4字节)+1(字节对齐)+1(char1字节)+2(字节对齐)+4(int4字节)+8(double 4字节))=25字节。</p>
<p><strong>test7</strong> 菱形继承（含有虚继承）</p>
<pre class="line-numbers language-cpp" data-language="cpp"><code class="language-cpp"><span class="token keyword">class</span> <span class="token class-name">A</span> <span class="token punctuation">{</span>
<span class="token keyword">public</span><span class="token operator">:</span>
   <span class="token keyword">char</span> az<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">B</span> <span class="token operator">:</span> <span class="token base-clause"><span class="token keyword">virtual</span> <span class="token keyword">public</span> <span class="token class-name">A</span></span><span class="token punctuation">{</span>
    <span class="token keyword">char</span> ca<span class="token punctuation">;</span>
    <span class="token keyword">int</span> a<span class="token punctuation">;</span>
    <span class="token keyword">double</span> s<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">C</span> <span class="token operator">:</span> <span class="token base-clause"><span class="token keyword">virtual</span> <span class="token keyword">public</span> <span class="token class-name">A</span></span> <span class="token punctuation">{</span>
    <span class="token keyword">char</span> ca<span class="token punctuation">;</span>
    <span class="token keyword">int</span> a<span class="token punctuation">;</span>
    <span class="token keyword">double</span> s<span class="token punctuation">;</span>
<span class="token keyword">public</span><span class="token operator">:</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">class</span> <span class="token class-name">E</span> <span class="token operator">:</span><span class="token base-clause"><span class="token keyword">public</span> <span class="token class-name">C</span><span class="token punctuation">,</span><span class="token keyword">public</span> <span class="token class-name">B</span></span> <span class="token punctuation">{</span>
    <span class="token keyword">int</span> a<span class="token punctuation">;</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword">void</span> <span class="token function">main</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
    B b<span class="token punctuation">;</span>
    cout <span class="token operator">&lt;&lt;</span> <span class="token keyword">sizeof</span><span class="token punctuation">(</span>E<span class="token punctuation">)</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span>
<span class="token punctuation">}</span><span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<p>在本例中，类B和类C都虚继承类A，而类E有继承类B和类C。</p>
<p>类E的大小为 24(类C不包含虚基类的部分的大小)+24(类B不包含虚基类的部分的大小)+4(int4字节)+4(字节对齐4字节)+1(虚基类A1字节)=57字节</p>
<p><a target="_blank" rel="noopener" href="https://imgtu.com/i/4JyDzT"><img src="https://z3.ax1x.com/2021/09/21/4JyDzT.png"></a></p>
<pre class="line-numbers language-none"><code class="language-none">1&gt;class E	size(57):
1&gt;	+---
1&gt; 0	| +--- (base class C)
1&gt; 0	| | {vbptr}
1&gt; 8	| | ca
1&gt;  	| | &lt;alignment member&gt; (size=3)
1&gt;12	| | a
1&gt;16	| | s
1&gt;	| +---
1&gt;24	| +--- (base class B)
1&gt;24	| | {vbptr}
1&gt;32	| | ca
1&gt;  	| | &lt;alignment member&gt; (size=3)
1&gt;36	| | a
1&gt;40	| | s
1&gt;	| +---
1&gt;48	| a
1&gt;  	| &lt;alignment member&gt; (size=4)
1&gt;	+---
1&gt;	+--- (virtual base A)
1&gt;56	| az
1&gt;	+---
1&gt;E::$vbtable@C@:
1&gt; 0	| 0
1&gt; 1	| 56 (Ed(C+0)A)
1&gt;E::$vbtable@B@:
1&gt; 0	| 0
1&gt; 1	| 32 (Ed(B+0)A)
1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
